app/views/hamburguesaingredientes/index.html.erb

</table>
<% @hamburguesa = Hamburguesa.find(1) %>
    <% @hamburguesa.hamburguesaingredientes.each do |hi| %>
---
SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "hamburguesaingredientes".* FROM "hamburguesaingredientes" WHERE "hamburguesaingredientes"."hamburguesa_id" = $1  [["hamburguesa_id", 1]]