app/controllers/hamburguesaingredientes_controller.rb

SELECT "hamburguesaingredientes".* FROM "hamburguesaingredientes" WHERE "hamburguesaingredientes"."hamburguesa_id" = $1  [["hamburguesa_id", 1]]
---
  def index
    @hamburguesaingredientes = Hamburguesaingrediente.all

SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "hamburguesaingredientes".* FROM "hamburguesaingredientes" WHERE "hamburguesaingredientes"."hamburguesa_id" = $1 AND "hamburguesaingredientes"."ingrediente_id" = $2 LIMIT $3  [["hamburguesa_id", 2], ["ingrediente_id", 2], ["LIMIT", 1]]
SELECT  "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "hamburguesaingredientes" ("hamburguesa_id", "ingrediente_id", "created_at", "updated_at", "path") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["hamburguesa_id", 1], ["ingrediente_id", 2], ["created_at", "2020-04-30 17:30:52.718302"], ["updated_at", "2020-04-30 17:30:52.718302"], ["path", "holi/2"]]
---
  def agregar_ingrediente
    @path = "https://apihamburguesas.herokuapp.com/ingrediente/"

    if Hamburguesa.exists?(id: params[:id_hamburguesa]) && Ingrediente.exists?(id: params[:id_ingrediente])
      @hamburguesa = Hamburguesa.find(params[:id_hamburguesa])
      if @hamburguesa.hamburguesaingredientes.find_by_ingrediente_id(params[:id_ingrediente])
        render json: {message: 'ya estaba agregado', status: 200}, status: 200
      else
        @hamburguesaingrediente = @hamburguesa.hamburguesaingredientes.build(ingrediente_id: params[:id_ingrediente])
        @hamburguesaingrediente.hamburguesa_id = params[:id_hamburguesa]
        @ingrediente = Ingrediente.find(params[:id_ingrediente])
        @hamburguesaingrediente.path = @ingrediente.path_ingrediente(@path)
        @hamburguesaingrediente.save

SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "hamburguesaingredientes".* FROM "hamburguesaingredientes" WHERE "hamburguesaingredientes"."hamburguesa_id" = $1 AND "hamburguesaingredientes"."ingrediente_id" = $2 LIMIT $3  [["hamburguesa_id", 1], ["ingrediente_id", 2], ["LIMIT", 1]]
DELETE FROM "hamburguesaingredientes" WHERE "hamburguesaingredientes"."id" = $1  [["id", 1]]
---
  def destroy
    if !Hamburguesa.exists?(id: params[:id_hamburguesa])
      render json: {message: 'Id de hamburguesa inválido', status: 400 }, status: 400
    else
      @hamburguesa = Hamburguesa.find(params[:id_hamburguesa])
      if @hamburguesa.hamburguesaingredientes.find_by_ingrediente_id(params[:id_ingrediente])
         @hamburguesaingrediente = Hamburguesaingrediente.find_by_hamburguesa_id_and_ingrediente_id(params[:id_hamburguesa], params[:id_ingrediente])
         @hamburguesaingrediente.destroy

SELECT  "hamburguesaingredientes".* FROM "hamburguesaingredientes" WHERE "hamburguesaingredientes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_hamburguesaingrediente
      @hamburguesaingrediente = Hamburguesaingrediente.find(params[:id])