app/controllers/hamburguesas_controller.rb

  def index
    @hamburguesas = Hamburguesa.all
---
SELECT "hamburguesas".* FROM "hamburguesas"

  def show
    @hamburguesa = Hamburguesa.find(params[:id])
---
SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    #render json: params
    #@hamburguesa = Hamburguesa.new(params)
    #render json: {"hola": "veamos"}
    @nombre = params[:nombre]
    @descripcion = params[:descripcion]
    @precio = params[:precio]
    @ham = Hamburguesa.find_or_create_by(nombre: @nombre, precio: @precio,descripcion: @descripcion  )
---
INSERT INTO "hamburguesas" ("nombre", "precio", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "cheese burger"], ["precio", 3990], ["descripcion", "hamburguesa con queso y tomate"], ["created_at", "2020-04-28 02:05:29.539965"], ["updated_at", "2020-04-28 02:05:29.539965"]]
SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."nombre" = $1 AND "hamburguesas"."precio" = $2 AND "hamburguesas"."descripcion" = $3 LIMIT $4  [["nombre", "ham"], ["precio", 100], ["descripcion", "holi"], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @hamburguesa.update(hamburguesa_params)
---
UPDATE "hamburguesas" SET "descripcion" = $1, "updated_at" = $2 WHERE "hamburguesas"."id" = $3  [["descripcion", "hoal"], ["updated_at", "2020-05-05 01:05:12.710169"], ["id", 5]]

    def set_hamburguesa
      @hamburguesa = Hamburguesa.find(params[:id])
---
SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]