app/controllers/ingredientes_controller.rb

SELECT "ingredientes".* FROM "ingredientes"
---
  def index
    @ingredientes = Ingrediente.all

SELECT  "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    if Ingrediente.exists?(id: params[:id])
      @ingrediente = Ingrediente.find(params[:id])

INSERT INTO "ingredientes" ("id", "nombre", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 40], ["nombre", "prueba"], ["descripcion", "ja"], ["created_at", "2020-05-01 01:13:26.213857"], ["updated_at", "2020-05-01 01:13:26.213857"]]
---
  def create
    @nombre = params[:nombre]
    @descripcion = params[:descripcion]
    if @nombre.nil? || @descripcion.nil?
      render json: {message: "input invalido", status: 400}, status: 400
    else
      if helpers.is_not_number?(@nombre) && helpers.is_not_number?(@descripcion)
        if !@nombre.empty? || !@descripcion.empty?
          @ingrediente = Ingrediente.create(nombre: params[:nombre], descripcion: params[:descripcion], id: params[:id])

SELECT  "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "hamburguesaingredientes".* FROM "hamburguesaingredientes" WHERE "hamburguesaingredientes"."ingrediente_id" = $1  [["ingrediente_id", 1]]
DELETE FROM "ingredientes" WHERE "ingredientes"."id" = $1  [["id", 1]]
---
  def destroy
    if Ingrediente.exists?(id: params[:id])
      @ingrediente = Ingrediente.find(params[:id])
      if @ingrediente.hamburguesaingredientes.length > 0
        render json: {message: 'Ingrediente no se puede borrar, se encuentra presente en una hamburguesa', status: 409}, status: 409
      else

        @ingrediente.destroy